{
  "aquarium_animals": [
    { "name": "African Butterfly Fish", "type_of_aquarium": "Freshwater", "info": "African Butterfly Fish are unique, peaceful fish known for their broad pectoral fins that resemble butterfly wings. They prefer a well-planted tank with plenty of hiding spaces. They thrive in slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). African Butterfly Fish are carnivorous and should be fed a diet of insects and small invertebrates." },
    { "name": "Amano Shrimp", "type_of_aquarium": "Freshwater", "info": "Amano Shrimp are highly efficient algae eaters in freshwater tanks. They are known for their ability to clean up various algae types, making them an excellent addition to any planted tank. Amano Shrimp prefer slightly acidic to neutral water with temperatures between 20–26°C (68–79°F). They are peaceful and can be kept with other non-aggressive species." },
    { "name": "Anemone Fish", "type_of_aquarium": "Saltwater", "info": "Anemone Fish, also known as Clownfish, form a symbiotic relationship with sea anemones in saltwater aquariums. They are hardy and do well in tanks with temperatures between 24–28°C (75–82°F). Anemone Fish are omnivorous, feeding on a variety of foods including meaty preparations and algae. They require stable water parameters and should be kept with peaceful tank mates." },
    { "name": "Angelfish (Koi)", "type_of_aquarium": "Freshwater", "info": "Koi Angelfish are freshwater fish with a mix of gold, black, and white coloration. They are peaceful but can be territorial during breeding. They thrive in aquariums with stable temperatures between 24–28°C (75–82°F) and slightly acidic to neutral water. Koi Angelfish require a well-planted tank and should be fed a diet of high-quality flakes or pellets." },
    { "name": "Angelfish", "type_of_aquarium": "Freshwater", "info": "Angelfish are beautiful and elegant freshwater fish, ideal for community tanks. They require a minimum tank size of 20 gallons and thrive in slightly acidic to neutral water conditions with temperatures between 24–28°C (75–82°F). They are peaceful but may be territorial during breeding, so be mindful of tank mates. Provide them with plenty of plants and hiding spots." },
    { "name": "Arowana", "type_of_aquarium": "Freshwater", "info": "Arowanas are large, impressive freshwater fish known for their elongated bodies and silvery scales. They require a very large tank (at least 125 gallons) and are best kept with other large, non-aggressive species. Arowanas thrive in slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). They are carnivorous and require a diet consisting of high-protein foods." },
    { "name": "Axolotl", "type_of_aquarium": "Freshwater", "info": "Axolotls are aquatic salamanders that remain in their larval stage throughout their lives, making them unique among amphibians. They are peaceful and can grow up to 12 inches long. Axolotls need a cool freshwater aquarium with temperatures between 16–18°C (60–64°F) and neutral to slightly alkaline water. They are carnivorous and will eat worms, small fish, and other meaty foods." },
    { "name": "Banggai Cardinalfish", "type_of_aquarium": "Saltwater", "info": "Banggai Cardinalfish are small, peaceful fish with a unique body shape and long fins. They do well in reef aquariums and prefer stable water conditions with temperatures between 24–28°C (75–82°F). They are omnivores and should be fed a variety of small meaty foods and algae." },
    { "name": "Bangus Catfish", "type_of_aquarium": "Freshwater", "info": "Bangus Catfish are peaceful, bottom-dwelling fish that prefer to live in schools. They thrive in slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). Bangus Catfish are omnivores and feed on detritus, small invertebrates, and plant matter." },
    { "name": "Betta Fish", "type_of_aquarium": "Freshwater", "info": "Betta Fish, also known as Siamese Fighting Fish, are vibrant and active freshwater fish known for their long, flowing fins. They thrive in smaller tanks (minimum 5 gallons), but should only be kept with other non-aggressive species due to their territorial nature. Betta Fish prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are carnivorous and can be fed high-protein foods like pellets and frozen bloodworms." },
    { "name": "Black Clownfish", "type_of_aquarium": "Saltwater", "info": "Black Clownfish are a variant of the popular orange Clownfish but with striking black and white coloration. They are hardy and can be kept in reef aquariums. Black Clownfish thrive in slightly alkaline water and temperatures between 24–28°C (75–82°F). They are omnivores and feed on a variety of foods, including algae and small meaty foods." },
    { "name": "Blue Lobster", "type_of_aquarium": "Freshwater", "info": "Blue Lobsters are vibrant, large freshwater crustaceans known for their striking blue coloration. They require a tank with hiding places and a substrate where they can burrow. Blue Lobsters thrive in slightly alkaline water with temperatures between 22–28°C (72–82°F). They are omnivores and feed on plant matter, detritus, and small invertebrates." },
    { "name": "Blue Tang", "type_of_aquarium": "Saltwater", "info": "The Blue Tang, also known as the Palette Surgeonfish, is a bright blue saltwater fish with a characteristic yellow tail. These fish are very active and require a large tank (at least 70 gallons) with plenty of live rock and swimming space. Blue Tangs are herbivores, feeding primarily on algae. They prefer temperatures between 24–28°C (75–82°F) and should be kept with other peaceful species." },
    { "name": "Cardinal Tetra", "type_of_aquarium": "Freshwater", "info": "Cardinal Tetras are small, peaceful fish known for their bright red and blue coloration. They do well in schools of six or more and prefer a well-planted tank with soft, acidic water. Cardinal Tetras thrive in temperatures between 22–28°C (72–82°F) and are compatible with other peaceful species. Their vibrant colors make them a beautiful addition to any community aquarium." },
    { "name": "Cardinalfish", "type_of_aquarium": "Saltwater", "info": "Cardinalfish are peaceful, small saltwater fish that do well in schools. They require a well-established reef tank with plenty of hiding spots. Cardinalfish feed on small crustaceans and are omnivorous, accepting frozen or prepared foods. They prefer temperatures between 24–28°C (75–82°F) and make great additions to peaceful reef aquariums." },
    { "name": "Cherry Barb", "type_of_aquarium": "Freshwater", "info": "Cherry Barbs are small, peaceful fish with a deep red coloration. They are great for community tanks and thrive in slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). Cherry Barbs are omnivores and should be fed a mix of flakes, pellets, and live food." },
    { "name": "Cherry Shrimp", "type_of_aquarium": "Freshwater", "info": "Cherry Shrimp are small, colorful freshwater shrimp that are great for maintaining a clean aquarium. They feed on algae and detritus, making them perfect for planted tanks. Cherry Shrimp prefer slightly acidic to neutral water with temperatures between 22–28°C (72–82°F). They are peaceful and should be kept with other non-aggressive species." },
    { "name": "Chromis", "type_of_aquarium": "Saltwater", "info": "Chromis are peaceful, small saltwater fish that thrive in schools. They prefer a reef-style aquarium with plenty of swimming space and live rock. Chromis prefer temperatures between 24–28°C (75–82°F) and stable water conditions. They are omnivores and enjoy a diet of algae and small meaty foods." },
    { "name": "Cichlid (Electric Blue Hap)", "type_of_aquarium": "Freshwater", "info": "Electric Blue Haps are strikingly beautiful freshwater cichlids that require a spacious tank (minimum 55 gallons). They prefer slightly alkaline water and temperatures between 24–28°C (75–82°F). These fish are omnivores and need a diet consisting of pellets, live food, and plant matter." },
    { "name": "Cleaner Wrasse", "type_of_aquarium": "Saltwater", "info": "The Cleaner Wrasse is a small but highly beneficial fish for saltwater tanks, especially in reef setups. These fish form symbiotic relationships with other species by cleaning parasites from their skin. Cleaner Wrasses are peaceful and require a tank of at least 50 gallons with plenty of live rock for hiding and grazing. Water temperature should be maintained between 24–28°C (75–82°F)." },
    { "name": "Clown Loach", "type_of_aquarium": "Freshwater", "info": "Clown Loaches are peaceful, colorful freshwater fish with orange and black markings. They are social and should be kept in schools. They require a tank with plenty of hiding spaces and thrive in slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). Clown Loaches are omnivores and should be fed a mix of pellets, flakes, and live food." },
    { "name": "Clownfish (Ocellaris)", "type_of_aquarium": "Saltwater", "info": "Ocellaris Clownfish, also known as the False Clownfish, are small, colorful saltwater fish. They have a symbiotic relationship with sea anemones but can also live in a reef tank without them. They require a well-established tank with stable water parameters and a temperature range between 24–28°C (75–82°F). Clownfish are omnivores and eat a variety of foods such as flakes, pellets, and live foods." },
    { "name": "Clownfish", "type_of_aquarium": "Saltwater", "info": "Clownfish are vibrant, peaceful saltwater fish that are ideal for reef tanks. They form a symbiotic relationship with sea anemones, which provide shelter for the clownfish. While they can live in a tank without an anemone, providing one will make them feel more at home. Clownfish require stable water parameters with temperatures between 24–28°C (75–82°F) and a tank of at least 30 gallons." },
    { "name": "Convict Cichlid", "type_of_aquarium": "Freshwater", "info": "Convict Cichlids are aggressive and territorial freshwater fish known for their striking black and white striped pattern. They require a spacious tank and should be kept with other robust species. Convict Cichlids thrive in slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are omnivores and will eat a variety of foods, including pellets, live food, and vegetables." },
    { "name": "Coral Beauty Angelfish", "type_of_aquarium": "Saltwater", "info": "The Coral Beauty Angelfish is a colorful and relatively peaceful fish suitable for reef tanks. It prefers a well-established aquarium with live rock and requires stable water parameters with temperatures between 24–28°C (75–82°F). This species is reef-safe but may nip at some coral species. A tank of at least 30 gallons is recommended to provide ample swimming space." },
    { "name": "Corydoras Catfish", "type_of_aquarium": "Freshwater", "info": "Corydoras Catfish are small, peaceful bottom dwellers that are great for keeping aquariums clean by eating leftover food and detritus. They prefer to be kept in schools and thrive in well-planted tanks with soft, slightly acidic to neutral water. Corydoras thrive in temperatures between 22–28°C (72–82°F). They are a perfect addition to peaceful community tanks." },
    { "name": "Corydoras Panda Catfish", "type_of_aquarium": "Freshwater", "info": "Panda Corydoras are small, peaceful bottom-dwelling fish with black and white markings. They are great for cleaning up leftover food and detritus in aquariums. They thrive in slightly acidic to neutral water with temperatures between 22–28°C (72–82°F). Corydoras Panda are best kept in schools and should be fed a variety of pellets, flakes, and frozen foods." },
    { "name": "Cuttlefish", "type_of_aquarium": "Saltwater", "info": "Cuttlefish are fascinating, intelligent cephalopods that require a large saltwater tank with plenty of hiding spots and live rock. They can change color and texture for camouflage, making them one of the most unique creatures in the aquarium trade. Cuttlefish are carnivores, feeding on small fish, shrimp, and crabs. They prefer water temperatures between 24–28°C (75–82°F)." },
    { "name": "Damsel Fish", "type_of_aquarium": "Saltwater", "info": "Damsel Fish are hardy and vibrant saltwater fish, often recommended for beginner saltwater aquariums. They are small and relatively easy to care for but can be territorial and aggressive, particularly as they mature. Damsels prefer a tank with stable water parameters and temperatures between 24–28°C (75–82°F). A tank size of at least 30 gallons is recommended." },
    { "name": "Discus Fish (Blue)", "type_of_aquarium": "Freshwater", "info": "The Blue Discus Fish is known for its beautiful blue coloration and distinctive, disk-shaped body. They thrive in well-planted, stable aquariums and prefer soft, slightly acidic to neutral water. Discus Fish require temperatures between 28–30°C (82–86°F) and should be kept in groups. They are sensitive to poor water conditions and need high water quality to thrive." },
    { "name": "Discus Fish", "type_of_aquarium": "Freshwater", "info": "Discus Fish are stunning, round-shaped freshwater fish that are highly prized for their coloration. They require a large tank (at least 50 gallons) and thrive in slightly acidic to neutral water with temperatures between 28–30°C (82–86°F). Discus Fish are best kept in schools and require a soft, well-filtered water environment." },
    { "name": "Electric Blue Acara", "type_of_aquarium": "Freshwater", "info": "Electric Blue Acara are striking freshwater cichlids known for their brilliant blue coloration. They are peaceful and do well in aquariums with plenty of hiding spots and plants. They prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). Electric Blue Acaras are omnivores and should be fed a variety of foods including pellets and live foods." },
    { "name": "Electric Yellow Cichlid", "type_of_aquarium": "Freshwater", "info": "Electric Yellow Cichlids are bright, vibrant freshwater fish that are popular in African cichlid tanks. They are territorial, so it’s best to keep them with other non-aggressive species. They thrive in slightly alkaline water with temperatures between 24–28°C (75–82°F). Electric Yellow Cichlids are omnivores and will eat a variety of foods including pellets and vegetables." },
    { "name": "Emperor Angelfish", "type_of_aquarium": "Saltwater", "info": "Emperor Angelfish are beautiful, vibrant saltwater fish with striking yellow and blue coloration. They require a large, well-maintained reef aquarium with plenty of live rock and swimming space. They prefer temperatures between 24–28°C (75–82°F) and stable water conditions. Emperor Angelfish are omnivores and need a varied diet of algae and small invertebrates." },
    { "name": "Firefish Goby", "type_of_aquarium": "Saltwater", "info": "Firefish Gobies are small, peaceful saltwater fish known for their striking red and white coloration. They are excellent for reef tanks and prefer a well-established aquarium with plenty of hiding spots. Firefish Gobies are omnivores, feeding on a variety of meaty and plant-based foods. They thrive in temperatures between 24–28°C (75–82°F)." },
    { "name": "Flame Angelfish", "type_of_aquarium": "Saltwater", "info": "Flame Angelfish are small, vibrant saltwater fish known for their bright red and orange coloration. They require a well-established reef aquarium with plenty of hiding places. Flame Angelfish are omnivores, eating a variety of foods such as algae, frozen foods, and meaty preparations. They prefer temperatures between 24–28°C (75–82°F) and are best kept with other peaceful fish." },
    { "name": "Giant Gourami", "type_of_aquarium": "Freshwater", "info": "Giant Gouramis are peaceful but can grow large (up to 24 inches), so they require a spacious tank (at least 75 gallons). They prefer slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). Giant Gouramis are omnivores and will accept a variety of foods, including pellets, flakes, and live food." },
    { "name": "Glofish (Tetra)", "type_of_aquarium": "Freshwater", "info": "Glofish Tetras are genetically modified fish with fluorescent, glowing colors. They are peaceful and small, making them ideal for community tanks. Glofish thrive in slightly acidic to neutral water and temperatures between 22–28°C (72–82°F). They are omnivores and can be fed a variety of flakes and live food." },
    { "name": "Gold Barb", "type_of_aquarium": "Freshwater", "info": "Gold Barbs are active, peaceful freshwater fish with vibrant golden colors. They prefer to live in groups of at least six and thrive in slightly acidic to neutral water. Gold Barbs require a tank of at least 20 gallons with good filtration and temperatures between 22–26°C (72–79°F). They are omnivorous and will accept a variety of foods including flakes, frozen foods, and vegetables." },
    { "name": "Gold Gourami", "type_of_aquarium": "Freshwater", "info": "Gold Gouramis are peaceful, medium-sized freshwater fish known for their striking golden coloration. They prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). Gold Gouramis do well in community tanks and should be kept with non-aggressive species. They are omnivores and will eat a variety of food types." },
    { "name": "Golden Pufferfish", "type_of_aquarium": "Freshwater", "info": "Golden Pufferfish are small, freshwater puffers known for their bright yellow color. They require a tank with plenty of hiding places and should not be kept with other fish that have soft bodies, as they have sharp beaks. Golden Puffers prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are carnivorous and need a diet of snails, shrimp, and other meaty foods." },
    { "name": "Goldfish", "type_of_aquarium": "Freshwater", "info": "Goldfish are popular, hardy freshwater fish that can live for many years with proper care. They require a large tank (at least 20 gallons for a single fish) with good filtration, as they produce a lot of waste. Goldfish prefer cooler water temperatures between 18–22°C (64–72°F) and should not be kept in small bowls. They do well with other peaceful species." },
    { "name": "Green Terror Cichlid", "type_of_aquarium": "Freshwater", "info": "Green Terror Cichlids are aggressive freshwater fish known for their beautiful green and blue coloration. They require a large tank and are best kept with other large, non-aggressive species. Green Terror Cichlids thrive in slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are omnivores and enjoy a variety of meaty foods." },
    { "name": "Guppy", "type_of_aquarium": "Freshwater", "info": "Guppies are small, peaceful, and colorful livebearers that do well in community tanks. They prefer slightly acidic to neutral water with temperatures between 22–28°C (72–82°F). Guppies thrive in schools and require a diet of flakes, live foods, and small pellets." },
    { "name": "Harlequin Tusk Fish", "type_of_aquarium": "Saltwater", "info": "Harlequin Tusk Fish are striking, predatory saltwater fish with large, canine-like teeth. They require a larger saltwater tank with plenty of live rock and a diet consisting of crustaceans and other meaty foods. Harlequin Tusk Fish prefer stable water conditions with temperatures between 24–28°C (75–82°F)." },
    { "name": "Hermit Crab", "type_of_aquarium": "Saltwater", "info": "Hermit Crabs are small, active scavengers that help keep your saltwater aquarium clean by eating leftover food and algae. They should be housed with other peaceful tankmates and given access to shells to protect their soft abdomens. Hermit Crabs thrive in tanks with temperatures between 24–28°C (75–82°F), stable salinity, and plenty of live rock to explore and hide in." },
    { "name": "Jack Dempsey Cichlid", "type_of_aquarium": "Freshwater", "info": "Jack Dempsey Cichlids are large, aggressive fish that require a spacious tank (at least 75 gallons). They thrive in slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). Jack Dempseys are omnivores and will eat a variety of foods, including pellets, live food, and vegetables." },
    { "name": "Jewel Cichlid", "type_of_aquarium": "Freshwater", "info": "Jewel Cichlids are strikingly colorful freshwater fish with red and orange hues. They are territorial and should be kept in larger tanks (at least 30 gallons) with other robust species. Jewel Cichlids prefer slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). They are omnivorous, eating a variety of foods, including pellets, flakes, and live food." },
    { "name": "Koi Fish", "type_of_aquarium": "Freshwater", "info": "Koi are large, colorful fish commonly kept in ponds or large freshwater aquariums. They require a spacious tank or pond with a capacity of at least 500 gallons, as they can grow up to 3 feet long. Koi thrive in temperatures between 18–24°C (64–75°F) and prefer slightly alkaline to neutral water. They are peaceful and can live for decades with proper care." },
    { "name": "Kuhli Loach", "type_of_aquarium": "Freshwater", "info": "Kuhli Loaches are small, peaceful bottom dwellers that have an eel-like appearance. They thrive in aquariums with plenty of hiding spots and soft, slightly acidic to neutral water. Kuhli Loaches prefer temperatures between 24–28°C (75–82°F). They are omnivores and feed on small invertebrates, algae, and detritus." },
    { "name": "Lemon Damselfish", "type_of_aquarium": "Saltwater", "info": "Lemon Damselfish are vibrant, yellow saltwater fish that thrive in reef aquariums. They are peaceful but can be aggressive to other fish of the same species. Lemon Damselfish prefer temperatures between 24–28°C (75–82°F) and stable water conditions. They are omnivores and enjoy a diet of algae and small invertebrates." },
    { "name": "Lionfish (Dwarf)", "type_of_aquarium": "Saltwater", "info": "Dwarf Lionfish are smaller versions of the classic Lionfish, making them more suitable for smaller saltwater tanks. They still require a minimum of 30 gallons and need plenty of live rock and hiding places. Dwarf Lionfish are carnivorous and should be fed a diet of small fish and shrimp. They prefer temperatures between 24–28°C (75–82°F)." },
    { "name": "Lionfish", "type_of_aquarium": "Saltwater", "info": "Lionfish are strikingly beautiful but venomous saltwater fish. They require a large tank (at least 75 gallons) with plenty of live rock for hiding and hunting small prey. Lionfish need a well-established aquarium with stable water parameters, and they should be kept with other non-aggressive species. Water temperature should be maintained between 24–28°C (75–82°F)." },
    { "name": "Mandarin Dragonet", "type_of_aquarium": "Saltwater", "info": "Mandarin Dragonets are beautiful, peaceful saltwater fish known for their vibrant colors and intricate patterns. They require a well-established reef tank with an abundant supply of copepods and other small invertebrates to feed on. Mandarin Dragonets require stable temperatures between 24–28°C (75–82°F) and are best kept in aquariums that have been running for several months." },
    { "name": "Mandarin Goby", "type_of_aquarium": "Saltwater", "info": "Mandarin Gobies are small, brightly colored fish that require a well-established reef aquarium with plenty of live rock and hiding places. They prefer slightly alkaline water and temperatures between 24–28°C (75–82°F). Mandarins are carnivores, feeding on copepods and other small invertebrates, and should not be kept in new or unstable tanks." },
    { "name": "Mantis Shrimp", "type_of_aquarium": "Saltwater", "info": "Mantis Shrimp are known for their powerful claws, which they use to strike prey. They are best kept in a species-only tank as they can be aggressive towards other tank mates. Mantis Shrimp require a well-established saltwater tank with live rock and temperatures between 24–28°C (75–82°F). They are carnivorous and feed on small fish and crustaceans." },
    { "name": "Marbled Hatchetfish", "type_of_aquarium": "Freshwater", "info": "Marbled Hatchetfish are small, peaceful fish that are known for their unique, flat bodies and ability to jump. They require a well-planted aquarium with soft, slightly acidic to neutral water. Marbled Hatchetfish prefer temperatures between 24–28°C (75–82°F) and are best kept in groups. They are omnivores, feeding on small live and frozen foods." },
    { "name": "Midas Cichlid", "type_of_aquarium": "Freshwater", "info": "Midas Cichlids are large, colorful freshwater fish with a territorial nature. They prefer slightly acidic to neutral water and thrive in aquariums with a minimum size of 55 gallons. Midas Cichlids should be kept with other robust fish and fed a diet of high-quality pellets and frozen food." },
    { "name": "Molly Fish", "type_of_aquarium": "Freshwater", "info": "Molly Fish are peaceful, live-bearing fish that come in a variety of colors. They are hardy and do well in community tanks. They prefer slightly alkaline to neutral water and a temperature range of 24–28°C (75–82°F). Molly Fish should be kept in schools and can be fed a diet of flakes, frozen food, and algae." },
    { "name": "Moorish Idol", "type_of_aquarium": "Saltwater", "info": "The Moorish Idol is a stunning but challenging fish to keep in a saltwater tank. It requires a large aquarium (at least 100 gallons) with plenty of live rock for grazing and hiding. Moorish Idols need a varied diet of meaty foods and algae, and they are not suitable for beginner aquarists. Water temperature should be kept between 24–28°C (75–82°F), and the tank must be stable with proper filtration." },
    { "name": "Moray Eel", "type_of_aquarium": "Saltwater", "info": "Moray Eels are fascinating, nocturnal saltwater fish known for their long, snake-like bodies. They require a large, well-established saltwater tank with plenty of hiding places. Moray Eels are carnivorous and prefer live rock aquariums with plenty of fish and invertebrates to hunt. They require stable temperatures between 24–28°C (75–82°F)." },
    { "name": "Neon Tetra", "type_of_aquarium": "Freshwater", "info": "Neon Tetras are small, vibrant fish with a glowing blue body and red tail. They are peaceful and should be kept in schools of 6 or more. Neon Tetras thrive in aquariums with slightly acidic to neutral water and temperatures between 22–28°C (72–82°F). They are omnivores and eat a variety of foods like flakes and small live foods." },
    { "name": "Oscar Fish", "type_of_aquarium": "Freshwater", "info": "Oscar Fish are large, intelligent freshwater fish that can grow up to 14 inches long. They are known for their aggressive nature, especially during feeding time or when they feel threatened. Oscars require a large tank (at least 75 gallons) with stable filtration and a water temperature range of 22–28°C (72–82°F). They are omnivorous and can be fed a variety of foods including pellets, live, and frozen foods." },
    { "name": "Peacock Cichlid", "type_of_aquarium": "Freshwater", "info": "Peacock Cichlids are brightly colored and moderately aggressive freshwater fish from Lake Malawi. They require a tank of at least 55 gallons, with plenty of rock structures for hiding. They prefer slightly alkaline water and thrive at temperatures between 24–28°C (75–82°F). A varied diet of pellets, frozen foods, and vegetables is recommended." },
    { "name": "Pearl Gourami", "type_of_aquarium": "Freshwater", "info": "Pearl Gouramis are peaceful freshwater fish with an elegant appearance. They thrive in slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). They prefer a well-planted tank with plenty of hiding spaces. Pearl Gouramis are omnivores and can be fed a variety of food, including flakes, pellets, and live food." },
    { "name": "Peppermint Shrimp", "type_of_aquarium": "Saltwater", "info": "Peppermint Shrimp are small, peaceful shrimp that are excellent at cleaning aquariums by eating detritus and algae. They prefer slightly alkaline water and temperatures between 24–28°C (75–82°F). Peppermint Shrimp should be kept with other peaceful species and can be fed a diet of algae, meaty foods, and detritus." },
    { "name": "Pictus Catfish", "type_of_aquarium": "Freshwater", "info": "Pictus Catfish are lively and active freshwater fish known for their unique spotted patterns. They prefer slightly acidic to neutral water and should be kept in schools. Pictus Catfish require a minimum tank size of 55 gallons and thrive in temperatures between 24–28°C (75–82°F). They are carnivores and should be fed high-protein foods such as pellets, live, or frozen food." },
    { "name": "Pink Skunk Clownfish", "type_of_aquarium": "Saltwater", "info": "Pink Skunk Clownfish are peaceful and hardy saltwater fish with soft pink and white coloration. They form symbiotic relationships with sea anemones but can also live in reef aquariums. These clownfish prefer water temperatures between 24–28°C (75–82°F). They are omnivores and thrive on a diet of flakes, pellets, and live food." },
    { "name": "Piranha", "type_of_aquarium": "Freshwater", "info": "Piranhas are predatory freshwater fish known for their sharp teeth and aggressive nature. They require a large, secure tank (at least 75 gallons) and should be kept alone or with other similarly aggressive species. Piranhas prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are carnivorous and should be fed meaty foods." },
    { "name": "Pistol Shrimp", "type_of_aquarium": "Saltwater", "info": "Pistol Shrimp are small, colorful invertebrates that are often kept in saltwater aquariums with a symbiotic relationship with gobies. These shrimp are known for their powerful claw, which they use to create a snapping sound to stun prey and defend themselves. They thrive in well-established reef tanks and prefer a temperature range of 24–28°C (75–82°F)." },
    { "name": "Platies", "type_of_aquarium": "Freshwater", "info": "Platies are small, colorful livebearers that are easy to care for and great for beginners. They prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). Platies are peaceful and should be kept in schools. They are omnivores and should be fed a variety of flakes and live food." },
    { "name": "Plecostomus", "type_of_aquarium": "Freshwater", "info": "Plecostomus, or Plecos, are popular freshwater fish known for their algae-eating habits. They require a tank of at least 75 gallons, as they can grow quite large. Plecos prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are peaceful and work well in community tanks, but they do require ample hiding places." },
    { "name": "Pufferfish (Freshwater)", "type_of_aquarium": "Freshwater", "info": "Freshwater Pufferfish are small, peaceful fish that can inflate their bodies when threatened. They are best kept in a tank with a soft substrate and plenty of hiding spots. Pufferfish prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are carnivores and feed on small invertebrates, snails, and other meaty foods." },
    { "name": "Purple Dottyback", "type_of_aquarium": "Saltwater", "info": "The Purple Dottyback is a small but striking saltwater fish with vivid purple coloration. It is relatively hardy but can be aggressive toward other small fish. It thrives in a reef aquarium and should be kept with other non-aggressive species. A tank of at least 30 gallons is recommended, with temperatures maintained between 24–28°C (75–82°F)." },
    { "name": "Pygmy Corydoras", "type_of_aquarium": "Freshwater", "info": "Pygmy Corydoras are tiny, peaceful bottom-dwelling fish that thrive in schools. They are excellent scavengers and help clean the tank by eating leftover food and detritus. Pygmy Corydoras are best kept in well-planted tanks with gentle filtration, temperatures between 22–28°C (72–82°F), and a slightly acidic to neutral pH. They do well with other peaceful species in community tanks." },
    { "name": "Rainbow Shark (Red-Finned)", "type_of_aquarium": "Freshwater", "info": "The Red-Finned Rainbow Shark is a colorful and active fish that requires a spacious tank. They are territorial and can be aggressive with other sharks or similar species. They prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are omnivores and need a varied diet of algae and meaty foods." },
    { "name": "Rainbow Shark", "type_of_aquarium": "Freshwater", "info": "Rainbow Sharks, also known as Red-Finned Sharks, are active and colorful freshwater fish. They need a tank of at least 55 gallons, as they are territorial, especially as they mature. Rainbow Sharks require temperatures between 24–28°C (75–82°F) and should be kept with other non-territorial species. They prefer slightly alkaline water with good filtration." },
    { "name": "Rainbowfish (Boesemani)", "type_of_aquarium": "Freshwater", "info": "Boesemani Rainbowfish are active and colorful freshwater fish with blue and orange hues. They require a well-planted aquarium with plenty of swimming space and prefer slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). Rainbowfish are peaceful and do well in schools of 6 or more individuals." },
    { "name": "Rainbowfish", "type_of_aquarium": "Freshwater", "info": "Rainbowfish are vibrant, active freshwater fish known for their stunning colors. They thrive in schools and require a tank of at least 30 gallons with gentle filtration and plenty of swimming space. Rainbowfish prefer slightly alkaline water with temperatures between 22–28°C (72–82°F). They are peaceful and can live harmoniously with other non-aggressive species in community tanks." },
    { "name": "Red Belly Piranha", "type_of_aquarium": "Freshwater", "info": "Red Belly Piranhas are predatory fish with a reputation for their sharp teeth and aggressive nature. They require a large tank (at least 75 gallons) and are best kept alone or with other similarly aggressive species. Red Belly Piranhas thrive in slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). They are carnivores and need a diet of meaty foods." },
    { "name": "Royal Gramma Basslet", "type_of_aquarium": "Saltwater", "info": "Royal Gramma Basslets are small, peaceful saltwater fish with vibrant purple and yellow coloration. They do well in reef aquariums with plenty of hiding spaces. Royal Gramma Basslets prefer temperatures between 24–28°C (75–82°F) and are omnivores, feeding on a mix of live and frozen foods." },
    { "name": "Royal Gramma", "type_of_aquarium": "Saltwater", "info": "Royal Grammas are small, vibrant saltwater fish with striking purple and yellow coloration. They are hardy and easy to care for in a reef aquarium, where they will find plenty of hiding spots among live rock. Royal Gramma prefer temperatures between 24–28°C (75–82°F) and are peaceful, making them ideal for community aquariums." },
    { "name": "Sailfin Tang", "type_of_aquarium": "Saltwater", "info": "Sailfin Tangs are large, vibrant fish with a large dorsal fin resembling a sail. They require a large aquarium with plenty of swimming space and live rock. Sailfin Tangs are herbivores and need a diet rich in algae. They prefer temperatures between 24–28°C (75–82°F) and need stable water parameters." },
    { "name": "Scooter Blenny", "type_of_aquarium": "Saltwater", "info": "Scooter Blennies are small, peaceful saltwater fish that are often found in reef aquariums. They have a unique way of 'scooting' along the bottom, feeding primarily on copepods and other small invertebrates. Scooter Blennies require a well-established tank with stable water parameters and temperatures between 24–28°C (75–82°F)." },
    { "name": "Seahorse", "type_of_aquarium": "Saltwater", "info": "Seahorses are unique and fascinating saltwater fish that require special care. They need a calm, peaceful tank with stable water parameters and a minimum of 30 gallons. Seahorses prefer temperatures between 24–26°C (75–79°F) and should be kept with slow-moving fish and invertebrates. They feed on small crustaceans like copepods and brine shrimp, and it's crucial to ensure a well-established aquarium for them to thrive." },
    { "name": "Sergeant Major Damselfish", "type_of_aquarium": "Saltwater", "info": "The Sergeant Major Damselfish is a vibrant saltwater species known for its bold blue and yellow stripes. They are hardy and easy to care for but can be territorial, especially during breeding. They require a tank of at least 30 gallons and prefer water temperatures between 24–28°C (75–82°F). Sergeant Major Damselfish are omnivores and thrive on a diet of algae and meaty foods." },
    { "name": "Shark Catfish", "type_of_aquarium": "Freshwater", "info": "Shark Catfish are large, bottom-dwelling fish that resemble sharks in appearance. They require a spacious tank (at least 75 gallons) and are best kept with other large, non-aggressive fish. Shark Catfish thrive in slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are omnivores and feed on algae, plant matter, and meaty foods." },
    { "name": "Shrimp (Ghost Shrimp)", "type_of_aquarium": "Freshwater", "info": "Ghost Shrimp are small, translucent freshwater shrimp that are excellent for cleaning aquariums. They are peaceful and can be kept with other small fish in a community tank. Ghost Shrimp thrive in slightly acidic to neutral water with temperatures between 22–26°C (72–79°F). They feed on algae, detritus, and leftover food in the aquarium." },
    { "name": "Silver Dollar Fish", "type_of_aquarium": "Freshwater", "info": "Silver Dollar Fish are peaceful, schooling fish with silver, disk-shaped bodies. They do well in schools of 5 or more and require a spacious tank with plenty of swimming space. Silver Dollars prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). They are herbivores and should be fed a diet rich in vegetables and algae." },
    { "name": "Six Line Wrasse", "type_of_aquarium": "Saltwater", "info": "Six Line Wrasse are colorful, active saltwater fish that can be beneficial for controlling pests like flatworms and bristle worms in a reef aquarium. They require a tank of at least 30 gallons with plenty of live rock and hiding spots. Six Line Wrasse thrive in temperatures between 24–28°C (75–82°F) and are generally peaceful, though they may be territorial with other wrasses." },
    { "name": "Snails (Apple Snail)", "type_of_aquarium": "Freshwater", "info": "Apple Snails are large freshwater snails that help keep aquariums clean by eating algae and leftover food. They are easy to care for and require a well-planted tank with stable water conditions. Apple Snails do well in a variety of water temperatures between 22–28°C (72–82°F). They should be kept with peaceful fish and not with species that may eat them." },
    { "name": "Spiny Starfish", "type_of_aquarium": "Saltwater", "info": "Spiny Starfish are large, hardy invertebrates that make excellent additions to saltwater aquariums. They require a well-established reef tank with stable water conditions. Spiny Starfish are scavengers, feeding on detritus, algae, and small invertebrates. They prefer temperatures between 24–28°C (75–82°F)." },
    { "name": "Swordtail (Red)", "type_of_aquarium": "Freshwater", "info": "Red Swordtails are live-bearing freshwater fish with a long, sword-like tail. They are peaceful and easy to care for, making them great for beginner aquarists. They prefer slightly acidic to neutral water and temperatures between 24–28°C (75–82°F). Swordtails do well in schools and should be fed a variety of foods, including pellets, frozen, and live food." },
    { "name": "Swordtail Fish", "type_of_aquarium": "Freshwater", "info": "Swordtail Fish are livebearers with a distinctive elongated tail fin. They are easy to care for and do well in community aquariums. Swordtails thrive in slightly acidic to neutral water and prefer temperatures between 24–28°C (75–82°F). They are peaceful and can be kept with a variety of other species in a well-planted tank." },
    { "name": "Tangs (Surgeonfish)", "type_of_aquarium": "Saltwater", "info": "Tangs, also known as Surgeonfish, are hardy and striking saltwater fish that require a large tank (at least 75 gallons). They need plenty of swimming space and a well-filtered, stable aquarium. Tangs feed on algae and benefit from a varied diet. Water temperature should be maintained between 24–28°C (75–82°F), and they should be kept in aquariums with live rock and a healthy filtration system." },
    { "name": "Tangs (Yellow Tang)", "type_of_aquarium": "Saltwater", "info": "Yellow Tangs are bright yellow saltwater fish that are commonly found in reef aquariums. They require a large tank with plenty of live rock and swimming space. Yellow Tangs are herbivores, feeding primarily on algae, and require a well-maintained tank with stable water parameters and temperatures between 24–28°C (75–82°F)." },
    { "name": "Tetra (Rummy Nose Tetra)", "type_of_aquarium": "Freshwater", "info": "Rummy Nose Tetras are small, peaceful fish known for their striking red noses and distinctive black markings. They thrive in schools and should be kept in groups of at least six. They require slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). Rummy Nose Tetras are omnivores and will eat flake food, live food, and frozen foods." },
    { "name": "Triggerfish", "type_of_aquarium": "Saltwater", "info": "Triggerfish are aggressive, powerful fish with strong jaws, often kept in saltwater reef tanks. They require a large tank (at least 75 gallons) and should be kept with other robust, similarly sized species. Triggerfish are carnivores, eating smaller fish, invertebrates, and crustaceans. They prefer water temperatures between 24–28°C (75–82°F) and need stable water conditions." },
    { "name": "Yellowtail Blue Damsel", "type_of_aquarium": "Saltwater", "info": "Yellowtail Blue Damsels are hardy and colorful saltwater fish that are perfect for reef aquariums. They are small and peaceful but can become territorial, especially towards other damsels. Yellowtail Damsels thrive in slightly alkaline water and temperatures between 24–28°C (75–82°F). They are omnivores and enjoy a diet of small invertebrates and algae." },
    { "name": "Yellowtail Damselfish", "type_of_aquarium": "Saltwater", "info": "Yellowtail Damselfish are hardy and colorful saltwater fish that are well-suited for reef aquariums. They are small and peaceful but can be aggressive towards other damselfish. Yellowtail Damselfish prefer temperatures between 24–28°C (75–82°F) and require stable, well-maintained water conditions. They are omnivores and will eat a mix of algae and meaty foods." },
    { "name": "Zebra Cichlid", "type_of_aquarium": "Freshwater", "info": "Zebra Cichlids are small, peaceful freshwater fish known for their striped patterns. They thrive in slightly acidic to neutral water with temperatures between 24–28°C (75–82°F). Zebra Cichlids do well in schools and should be fed a variety of high-quality flakes and pellets." },
    { "name": "Zebra Danio", "type_of_aquarium": "Freshwater", "info": "Zebra Danios are small, active freshwater fish with characteristic blue and silver stripes. They are hardy and easy to care for, making them great for beginners. Zebra Danios thrive in slightly acidic to neutral water and temperatures between 22–28°C (72–82°F). They are omnivores and do well in schools, eating a variety of flakes and small live foods." },
    { "name": "Zebra Pleco", "type_of_aquarium": "Freshwater", "info": "Zebra Plecos are small, strikingly patterned freshwater fish that are peaceful and do well in community tanks. They require a tank with plenty of hiding spaces and a soft substrate. Zebra Plecos prefer slightly acidic to neutral water and temperatures between 26–30°C (79–86°F). They are omnivores and should be fed a diet of algae, vegetables, and sinking pellets." }
  ]
}